<?php

return [

    /*
    |--------------------------------------------------------------------------
    | SSOServer 服务配置文件
    |--------------------------------------------------------------------------
    |
    | 与 SSOServer 对应的客户端 SSOBroker 连接到 SSOServer 前, 需要配置三个参数:
    |
    |   SSOServer-Url
    |   SSOBroker-Id
    |   SSOBroker-Secret
    |
    */


    /*
    |--------------------------------------------------------------------------
    | SSOServer 缓存用户登录状态的有效期
    |--------------------------------------------------------------------------
    | 缓存 SSOBroker的sso_session 与 SSOServer的linkedId 的关联的 有效时长, 单位分钟
    | 60分钟 * 24 * 30 = 43200分钟 = 30天
    */
    'cacheLifeTime' => 43200, //设置有效期是30天

    /*
    |--------------------------------------------------------------------------
    | SSOServer 的服务地址
    |--------------------------------------------------------------------------
    |
    */
    'url' => '/sso',

    /*
    |--------------------------------------------------------------------------
    | SSOBroker
    |--------------------------------------------------------------------------
    |
    | 这里登记了所有的客户端的 SSOBroker-Id 和 SSOBroker-Secret
    |
    */
    'brokers' => [
//        'Alice' => [
//            'secret' => '8iwzik1bwd'
//        ],
//
//        'Greg' => [
//            'secret' => '7pypoox2pc'
//        ],
//
//        'Julias' => [
//            'secret' => 'ceda63kmhp'
//        ],
    ],

];
